const restaurantsDB = [
  {
    "id": "1",
    "kakaoId": "27495281",
    "name": "돈천동식당",
    "score": "4.5",
    "category1": 0, //main이랑 다른 부분
    "tag1": "기름칠",
    "tag2": "매콤한",
    "distance": 300,
    "imgUrl": "images/restaurants/1.jpg",
    "detail": "상세설명은 아직 없습니다"
  },
  {
    "id": "3",
    "kakaoId": null,
    "name": "리피토리아",
    "score": "4.5",
    "category1": 0,
    "tag1": "분위기",
    "tag2": "기름칠",
    "distance": 300,
    "imgUrl": "images/restaurants/3.jpg",
    "detail": "상세설명은 아직 없습니다"
  },
  {
    "id": "2",
    "kakaoId": "7850862",
    "name": "라본느타르트",
    "category1": 2,
    "score": "4.5",
    "tag1": "디저트",
    "tag2": null,
    "distance": 300,
    "imgUrl": "images/restaurants/2.jpg",
    "detail": "상세설명은 아직 없습니다"
  },
  {
    "id": "4",
    "kakaoId": "1948873687",
    "name": "라플로레종",
    "category1": 2,
    "score": "4.5",
    "tag1": "디저트",
    "tag2": "분위기",
    "distance": 300,
    "imgUrl": "images/restaurants/4.jpg",
    "detail": "상세설명은 아직 없습니다"
  },
  {
    "id": "5",
    "kakaoId": "1614398403",
    "name": "하우스라운",
    "category1": 1,
    "score": "4.5",
    "tag1": "분위기",
    "tag2": "저렴한",
    "distance": 300,
    "imgUrl": "images/restaurants/5.jpg",
    "detail": "상세설명은 아직 없습니다"
  },
];

const mainFilterIcons = ["🍚", "🥂", "☕️"];

const resScoreIcons = [
  ["😥", "실망이야"],
  ["😑", "쏘쏘해요"],
  ["🙂", "괜찮았어요"],
  ["😋", "맛있어요!"],
  ["🤤", "찐맛집이네"],
];

const resFilterIcons = [
  ["💰", "🍷️", "🥑", "🍵", "🌶", "🍤"],
  ["💰", "🍹", "🍜", "🍺", "🍶", "💬"],
  ["💰", "🌷", "🍰", "📒", "🗣", "☕"],
];

const List<Map<String, String>> resFilterTextIconMap = [
  {
    "저렴한": "💰",
    "분위기": "🍷️",
    "가볍게": "🥑",
    "따뜻한": "🍵",
    "매콤한": "🌶",
    "기름칠": "🍤"
  },
  {
    "저렴한": "💰",
    "분위기": "🍹",
    "안주맛집": "🍜",
    "소주맥주": "🍺",
    "막걸리": "🍶",
    "조용한": "💬"
  },
  {"저렴한": "💰", "분위기": "🌷", "디저트": "🍰", "카공": "📒", "대화": "🗣", "맛있는": "☕"},
];

const resFilterTexts = [
  ["저렴한 가격", "분위기 좋아", "가벼운 식사", "따뜻한 한상", "매콤힌 끼니", "배에 기름칠"],
  ["저렴한 가격", "분위기 좋아", "안주가 맛집", "소주랑 맥주", "구수한 막걸리", "조용한 술집"],
  ["저렴한 가격", "분위기 좋아", "달달한 디저트", "공부하기 딱", "대화하기 딱", "맛있는 커피"]
];

const resFilterTextsSh = [
  ["전체", "저렴한", "분위기", "가볍게", "따뜻한", "매콤한", "기름칠"],
  ["전체", "저렴한", "분위기", "안주맛집", "소주맥주", "막걸리", "조용한"],
  ["전체", "저렴한", "분위기", "디저트", "카공", "대화", "맛있는"]
];

const categoryTexts = ["밥집", "술집", "카페"];

// 0 밥집
// 0 저렴한 가격  1 분위기 좋아  2 가벼운 식사  3 따뜻한 한상  4 매콤힌 끼니  5 배에 기름칠

// 1 술집
// 0 저렴한 가격  1 분위기 좋아  2 안주가 맛집  3 소주랑 맥주  4 구수한 막걸리  5 조용한 술집

// 2 카페
// 0 저렴한 가격  1 분위기 좋아  2 달달한 디저트  3 공부하기 딱  4 대화하기 딱  5 맛있는 커피
